# GetFlangeThicknessInWidthCenter Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
StructuralSectionGeneralU..::..GetFlangeThicknessInWidthCenter Method
StructuralSectionGeneralU Class See Also
---
Returns thickness of flange measured in the 0.5 * width, sometimes used for sections with width <= 300 mm.
**Namespace:** Autodesk.Revit.DB.Structure.StructuralSections**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public double GetFlangeThicknessInWidthCenter()
```

Visual Basic
---
```text
Public Function GetFlangeThicknessInWidthCenter As Double
```

Visual C++
---
```text
public:
double GetFlangeThicknessInWidthCenter()
```

# See Also
StructuralSectionGeneralU Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace